mdmfile/src/Catalogs/мдмТочкиБизнесПроцесса/мдмТочкиБизнесПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиБизнесПроцесса</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>Точка</name>
    <type>
      <types>DefinedType.мдмТочкаБизнесПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/CommonModules/мдмБизнесПроцессыСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ТочкиБизнесПроцессаПриЗаписиОбработчик(Источник) Экспорт
	
	Точка = Справочники.мдмТочкиБизнесПроцесса.НайтиПоРеквизиту("Точка", Источник.Ссылка,, Источник.Владелец);
	
	Если Точка.Пустая() тогда
		
		ТочкаОбъект = Справочники.мдмТочкиБизнесПроцесса.СоздатьЭлемент();
		ТочкаОбъект.Точка = Источник.Ссылка;
		ТочкаОбъект.Владелец = Источник.Владелец;
		ТочкаОбъект.УстановитьНовыйКод();
		
	Иначе 
		
		ТочкаОбъект = Точка.ПолучитьОбъект();
		
	КонецЕсли;	
	
	ТочкаОбъект.ПометкаУдаления = Источник.ПометкаУдаления;
	ТочкаОбъект.Имя = Источник.Имя;
	ТочкаОбъект.Наименование = Источник.Наименование;
	ТочкаОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьИмяПередЗаписью(Источник, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(Источник.Имя) тогда
		
		Источник.Имя = мдмОбщегоНазначенияКлиентСервер.ИдентификаторПоСтроке(Источник.Имя);
		
	КонецЕсли;	
	
	Отказ = Не мдмОбщегоНазначенияСервер.ПроверитьНаДублиПоРавенству(Источник, Источник.КлючОбъекта());		
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Представление = "" + Данные.Ссылка.Наименование + " ("+ Данные.Ссылка.Владелец.Наименование +  ")";
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставленияМетаданных(Поля, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ПредставлениеСсылки");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставленияМетаданных(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.ПредставлениеСсылки;
	
КонецПроцедуры

#КонецОбласти
